W4D5/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at", "band_owner_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "take573"], ["created_at", "2019-02-01 00:31:47.300185"], ["updated_at", "2019-02-01 00:31:47.300185"], ["band_owner_id", 1]]
---
  def create
    @band = Band.new(name: params[:band][:name], band_owner_id: current_user.id)
    if @band.save!

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "take59"], ["updated_at", "2019-01-31 23:20:57.591342"], ["id", 1]]
---
  def update
    @band = Band.find(params[:id])
    if @band.update_attributes(name: params[:band][:name])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
  def destroy
    band = Band.find(params[:id])
    if band.delete

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "bands" WHERE "bands"."user_id" = $1 AND "bands"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
   def verify_band_ownership
    if !current_user.bands.include?(Band.find(params[:id]))
      flash[:errors] = 'Cannot edit a band you did not create'
      redirect_to band_url(Band.find(params[:id]))